{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "RobertaForQuestionAnswering",
    "parent_library": "transformers.models.roberta.modeling_roberta"
  },
  "base_model_name_or_path": "FacebookAI/roberta-large",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 16,
  "lora_dropout": 0.1,
  "lora_inhibition": 0.9,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": [
    "LayerNorm",
    "classifier",
    "qa_outputs"
  ],
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "key",
    "value",
    "query"
  ],
  "task_type": null,
  "use_dora": false,
  "use_rslora": false
}